web/src/test/resources/integrationtests/sendmessagetorecipient/requests.stg

delimiters "$", "$"

request(data) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:riv:clinicalprocess:healthcond:certificate:SendMessageToRecipientResponder:1" xmlns:urn2="urn:riv:clinicalprocess:healthcond:certificate:types:2" xmlns:urn3="urn:riv:clinicalprocess:healthcond:certificate:2">
   <soapenv:Header>
      <urn:LogicalAddress>fk</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:SendMessageToRecipient>
         <urn1:meddelande-id>meddid1</urn1:meddelande-id>
         <!--Optional:-->
         <urn1:referens-id>refid</urn1:referens-id>
         <urn1:skickatTidpunkt>2016-05-23T00:00:00</urn1:skickatTidpunkt>
         <urn1:intygs-id>
            <urn2:root>ddd</urn2:root>
            <urn2:extension>intyg-10</urn2:extension>
         </urn1:intygs-id>
         <urn1:patientPerson-id>
            <urn2:root>1.2.752.129.2.1.3.1</urn2:root>
            <urn2:extension>191212121212</urn2:extension>
         </urn1:patientPerson-id>
         <urn1:logiskAdressMottagare>fk</urn1:logiskAdressMottagare>
         <urn1:amne>
            <urn2:code>KOMPLT</urn2:code>
            <urn2:codeSystem>ffa59d8f-8d7e-46ae-ac9e-31804e8e8499</urn2:codeSystem>
            <!--Optional:-->
            <urn2:displayName>eedd</urn2:displayName>
         </urn1:amne>
         <!--Optional:-->
         <urn1:rubrik>rubrik</urn1:rubrik>
         <urn1:meddelande>meddelande</urn1:meddelande>
         <urn1:skickatAv>
            <urn3:personal-id>
               <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
               <urn2:extension>SE2321000016-6G5R</urn2:extension>
            </urn3:personal-id>
            <urn3:fullstandigtNamn>Test Testorsson</urn3:fullstandigtNamn>
            <!--Optional:-->
            <urn3:forskrivarkod>09874321</urn3:forskrivarkod>
            <!--Zero or more repetitions:-->
            <urn3:befattning>
               <urn2:code>20101010</urn2:code>
               <urn2:codeSystem>1.2.752.129.2.2.1.4</urn2:codeSystem>
               <!--Optional:-->
               <urn2:displayName>kosmonaut</urn2:displayName>
            </urn3:befattning>
            <urn3:enhet>
               <urn3:enhets-id>
                  <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
                  <urn2:extension>id</urn2:extension>
               </urn3:enhets-id>
               <urn3:arbetsplatskod>
                  <urn2:root>1.2.752.29.4.71</urn2:root>
                  <urn2:extension>45312</urn2:extension>
               </urn3:arbetsplatskod>
               <urn3:enhetsnamn>zlorg</urn3:enhetsnamn>
               <urn3:postadress>zlarg</urn3:postadress>
               <urn3:postnummer>zlurg</urn3:postnummer>
               <urn3:postort>zlerg</urn3:postort>
               <urn3:telefonnummer>11414</urn3:telefonnummer>
               <!--Optional:-->
               <urn3:epost>ve1@vg1.se</urn3:epost>
               <urn3:vardgivare>
                  <urn3:vardgivare-id>
                     <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
                     <urn2:extension>SE2321000016-39KJ</urn2:extension>
                  </urn3:vardgivare-id>
                  <urn3:vardgivarnamn>Vårdgifvaren</urn3:vardgivarnamn>
                  <!--You may enter ANY elements at this point-->
               </urn3:vardgivare>
               <!--You may enter ANY elements at this point-->
            </urn3:enhet>
            <!--Zero or more repetitions:-->
            <urn3:specialistkompetens>
               <urn2:code>njae</urn2:code>
               <!--Optional:-->
               <urn2:displayName>nja tveksamt</urn2:displayName>
            </urn3:specialistkompetens>
            <!--You may enter ANY elements at this point-->
         </urn1:skickatAv>
         <!--You may enter ANY elements at this point-->
      </urn1:SendMessageToRecipient>
   </soapenv:Body>
</soapenv:Envelope>
>>
