web/src/test/resources/integrationtests/arende/request_recipient.stg

delimiters "$", "$"

request(data) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:riv:clinicalprocess:healthcond:certificate:SendMessageToRecipientResponder:1" xmlns:urn2="urn:riv:clinicalprocess:healthcond:certificate:types:3" xmlns:urn3="urn:riv:clinicalprocess:healthcond:certificate:3">
   <soapenv:Header>
      <urn:LogicalAddress>1</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:SendMessageToRecipient>
         <urn1:meddelande-id>$data.messageId$</urn1:meddelande-id>
         <!--Optional:-->
         <urn1:referens-id>refid</urn1:referens-id>
         <urn1:skickatTidpunkt>2014-11-22T14:53:00</urn1:skickatTidpunkt>
         <urn1:intygs-id>
            <urn2:root>1</urn2:root>
            <urn2:extension>$data.intygsId$</urn2:extension>
         </urn1:intygs-id>
         <urn1:patientPerson-id>
            <urn2:root>1.2.752.129.2.1.3.1</urn2:root>
            <urn2:extension>$data.personId$</urn2:extension>
         </urn1:patientPerson-id>
         <urn1:logiskAdressMottagare>$data.enhetsId$</urn1:logiskAdressMottagare>
         <urn1:amne>
            <urn2:code>KOMPLT</urn2:code>
            <urn2:codeSystem>ffa59d8f-8d7e-46ae-ac9e-31804e8e8499</urn2:codeSystem>
         </urn1:amne>
         <!--Optional:-->
         <urn1:rubrik>$data.arende$</urn1:rubrik>
         <urn1:meddelande>tdggdg2</urn1:meddelande>
         <urn1:skickatAv>
            <urn3:personal-id>
               <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
               <urn2:extension>SE2321000016-6G5R</urn2:extension>
            </urn3:personal-id>
            <urn3:fullstandigtNamn>Grim Reaper</urn3:fullstandigtNamn>
            <urn3:enhet>
               <urn3:enhets-id>
                  <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
                  <urn2:extension>SE2321000016-H489</urn2:extension>
               </urn3:enhets-id>
               <urn3:arbetsplatskod>
                  <urn2:root>1.2.752.29.4.71</urn2:root>
                  <urn2:extension>45312</urn2:extension>
               </urn3:arbetsplatskod>
               <urn3:enhetsnamn>VE1</urn3:enhetsnamn>
               <urn3:postadress>Enhetsg. 1</urn3:postadress>
               <urn3:postnummer>100 10</urn3:postnummer>
               <urn3:postort>Stadby</urn3:postort>
               <urn3:telefonnummer>0812341234</urn3:telefonnummer>
               <urn3:vardgivare>
                  <urn3:vardgivare-id>
                     <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
                     <urn2:extension>SE2321000016-39KJ</urn2:extension>
                  </urn3:vardgivare-id>
                  <urn3:vardgivarnamn>VG1</urn3:vardgivarnamn>
                  <!--You may enter ANY elements at this point-->
               </urn3:vardgivare>
               <!--You may enter ANY elements at this point-->
            </urn3:enhet>
            <!--You may enter ANY elements at this point-->
         </urn1:skickatAv>
         <!--You may enter ANY elements at this point-->
      </urn1:SendMessageToRecipient>
   </soapenv:Body>
</soapenv:Envelope>
>>
